src/InformationRegisters/НастройкиИнтеграцииConfluence.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииConfluence</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоступПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазыЗнанийConfluence</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиИнтеграцииConfluence/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает все данные регистра по указанному пользователю и базе знаний.
// Если пользователь не указан, используется текущий пользователь
// Если база знаний не указана, используется основная база знаний
//
// Параметры:
//	ПользовательСсылка - СправочникСсылка.Пользователи
//	БазаЗнанийСсылка - СправочникСсылка.БазыЗнанийConfluence
//
// Возвращаемое значение:
//   Структура - см. РегистрСведений.НастройкиИнтеграцииConfluence
// 
Функция НастройкиПользователя(знач ПользовательСсылка = Неопределено, знач БазаЗнанийСсылка = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ПользовательСсылка) Тогда
		ПользовательСсылка = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БазаЗнанийСсылка) Тогда
		БазаЗнанийСсылка = Справочники.БазыЗнанийConfluence.ОсновнаяБазаЗнаний();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ПользовательСсылка);
	Запрос.УстановитьПараметр("БазаЗнаний"	, БазаЗнанийСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииConfluence.*
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииConfluence КАК НастройкиИнтеграцииConfluence
	|ГДЕ
	|	НастройкиИнтеграцииConfluence.Пользователь = &Пользователь
	|	И НастройкиИнтеграцииConfluence.БазаЗнаний = &БазаЗнаний";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Настройки = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		МассивТипов = Колонка.ТипЗначения.Типы();
		ИндексNULL	= МассивТипов.Найти(Тип("Null"));
		Если ИндексNULL <> Неопределено Тогда
			МассивТипов.Удалить(ИндексNULL);
		КонецЕсли;
		
		ТипКолонки = Новый ОписаниеТипов(МассивТипов);
		
		Настройки.Вставить(Колонка.Имя, ТипКолонки.ПривестиЗначение(Неопределено));
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
